In [16]:
import pandas as pd
import psycopg2 as pg
import numpy as np

In [2]:
db_conn = pg.connect("postgresql://wheretolive:wheretolive@192.168.86.145:5432/wheretolive")

In [36]:
target_zip_code = 8001
station_type = 'closest_station' # or clossest_train
station_field_name = 'closest_station' # or closest_train_station
max_commute_h = 1

people_ages_franchises = [(27, 2500), (26, 2500), (2, 0), (0, 0)]

num_children = 2
married = True
double_salary = True
income = 125000

mortgage_rate = 0.01
rooms_min = 4.5
rooms_max = 5.5

In [40]:
sql = """
select source_town.name, source_sbb_station.name, target_town.name, target_sbb_station.name, train_commute.time, train_commute.changes from commute 
join train_commute on train_commute.commute_id = commute.id
join town as source_town on source_town.id = commute.source_town_id
join town as target_town on target_town.id = commute.target_town_id
join sbb_station as source_sbb_station on source_sbb_station.id = source_town.<STATION_FIELD_NAME>_id
join sbb_station as target_sbb_station on target_sbb_station.id = target_town.<STATION_FIELD_NAME>_id
where train_commute.commute_type = '<STATION_TYPE>' and target_town.zip_code = <TARGET_ZIP> and train_commute.time <= <TIME>*3600
"""
sql = sql.replace("<TARGET_ZIP>", str(target_zip_code))
sql = sql.replace("<STATION_FIELD_NAME>", station_field_name)
sql = sql.replace("<STATION_TYPE>", station_type)
sql = sql.replace("<TIME>", str(max_commute_h))

In [41]:
df_towns = pd.read_sql(sql, db_conn)
df_towns.head(10)

,name,name,name,name,time,changes
0,Sünikon,"Steinmaur, Sünikon",Zürich,Zürich Limmatquai,3028,2
1,Bäretswil,"Bäretswil, Gemeindehaus",Zürich,Zürich Limmatquai,3567,1
2,Adetswil,"Adetswil, Sunneberg",Zürich,Zürich Limmatquai,3567,1
3,Bubikon,"Bubikon, Dorf",Zürich,Zürich Limmatquai,2667,0
4,Wolfhausen,"Wolfhausen, Post",Zürich,Zürich Limmatquai,3447,1
5,Elsau,"Elsau, Dorf",Zürich,Zürich Limmatquai,3027,1
6,Hettlingen,"Hettlingen, Dorf",Zürich,Zürich Limmatquai,3387,1
7,Aesch (Neftenbach),Aesch (Neftenbach),Zürich,Zürich Limmatquai,3267,1
8,Riet (Neftenbach),Riet (Neftenbach),Zürich,Zürich Limmatquai,3267,1
9,Hünikon (Neftenbach),Hünikon (Neftenbach),Zürich,Zürich Limmatquai,3447,1

In [4]:
sql = """
select town.zip_code, town.name, 120000*(tax_rate.rate/100) as taxes_chf from tax_rate
join town on town.bfs_nr = tax_rate.bfs_nr
where 
	profile = 'married_2_children_2_salaries' 
	and max_income >= <INCOME>
    and min_income <= <INCOME>
	and town.zip_code in (<ZIP_CODES>)
order by tax_rate.rate asc
"""
base_profile = ""
if married:
    if double_salary:
        base_profile = "married_2_children_2_salaries"
    else:
        if children > 0:
            base_profile = "married_2_children"
        else:
            base_profile = "married_0_children"
else:
    base_profile = "single"
    
# TODO: Check number of children and select penalty terms
# TODO: Create sql query containing already the correct subtractions

sql = sql.replace('<ZIP_CODES>', ','.join(df_towns['zip_code'].map(lambda x: str(x))))
sql = sql.replace("<INCOME>", str(income))

In [5]:
df_tax = pd.read_sql(sql, db_conn)
df_tax.head(10)

   zip_code      name    taxes_chf
0      6300       Zug   982.989000
1      1201    Genève  2762.659409
2      8180    Bülach  4320.000000
3      8001    Zürich  4454.400000
4      4800  Zofingen  6548.484000
5      6260    Reiden  8510.700000
6      4600     Olten  9357.043800
7      3004      Bern  9544.654080

In [6]:
sql = """
select zip_code, sum(rate)*24 as health_insurance_chf from
	(select zip_code, min_birth_year, franchise, avg(rate) as rate from health_insurance_rate
	where zip_code in (8180, 4600, 4800, 3004, 6300, 8001, 1201, 6260)
	and franchise in (2500, 0)
	and min_birth_year in (2020, 1994)
	group by zip_code, min_birth_year, franchise) as tab
	group by zip_code
"""

In [7]:
df_health = pd.read_sql(sql, db_conn)
df_health.head(10)

   zip_code  health_insurance_chf
0      1201          14476.477612
1      3004          12311.301176
2      4600          10156.065455
3      4800           9481.385714
4      6260           8245.909756
5      6300           8262.905660
6      8001          11659.869767
7      8180           9241.221176

In [8]:
sql = """
select zip_code, is_rent, price from accomodation
where zip_code in (8180, 4600, 4800, 3004, 6300, 8001, 1201, 6260) 
and rooms <= 5.5 and rooms >= 4.5 and price > 0
"""

In [18]:
df_acc = pd.read_sql(sql, db_conn)
df_acc.loc[df_acc.is_rent, 'yearly_cost_home'] = df_acc[df_acc.is_rent]['price']*12
df_acc.loc[~df_acc.is_rent, 'yearly_cost_home'] = df_acc[~df_acc.is_rent]['price']*(0.01 + 0.8*0.01)
df_acc = df_acc.drop(['price', 'is_rent'], axis=1)
df_acc = df_acc.groupby(by='zip_code').agg({"yearly_cost_home": [np.median, 'count']}).reset_index()
df_acc.head(10)

  zip_code yearly_cost_home
                     median count
0     1201          57600.0     5
1     3004          18360.0     1
2     4600          14670.0     3
3     4800          19800.0    63
4     6260          13770.0    11
5     8001          83400.0     9
6     8180          18225.0    22

In [25]:
df = df_tax.merge(df_health).merge(df_acc, left_on='zip_code', right_on='zip_code')
df['median_yearly_cost_home'] = df[('yearly_cost_home', 'median')]
df['home_count'] = df[('yearly_cost_home', 'count')]
df = df.drop([('yearly_cost_home', 'count'), ('yearly_cost_home', 'median')], axis=1)
df.head(10)

,zip_code,name,taxes_chf,health_insurance_chf,median_yearly_cost_home,home_count
0,1201,Genève,2762.659409,14476.477612,57600.0,5
1,8180,Bülach,4320.000000,9241.221176,18225.0,22
2,8001,Zürich,4454.400000,11659.869767,83400.0,9
3,4800,Zofingen,6548.484000,9481.385714,19800.0,63
4,6260,Reiden,8510.700000,8245.909756,13770.0,11
5,4600,Olten,9357.043800,10156.065455,14670.0,3
6,3004,Bern,9544.654080,12311.301176,18360.0,1

In [26]:
df['total'] = df['taxes_chf'] + df['health_insurance_chf'] + df['median_yearly_cost_home']
df['percent_of_income'] = (df['total']/120000)*100
df = df.sort_values(by='total')
df.head(10)

,zip_code,name,taxes_chf,health_insurance_chf,median_yearly_cost_home,home_count,total,percent_of_income
4,6260,Reiden,8510.700000,8245.909756,13770.0,11,30526.609756,25.438841
1,8180,Bülach,4320.000000,9241.221176,18225.0,22,31786.221176,26.488518
5,4600,Olten,9357.043800,10156.065455,14670.0,3,34183.109255,28.485924
3,4800,Zofingen,6548.484000,9481.385714,19800.0,63,35829.869714,29.858225
6,3004,Bern,9544.654080,12311.301176,18360.0,1,40215.955256,33.513296
0,1201,Genève,2762.659409,14476.477612,57600.0,5,74839.137021,62.365948
2,8001,Zürich,4454.400000,11659.869767,83400.0,9,99514.269767,82.928558